## Reading the file

In [1]:
import pandas as pd
df=pd.read_excel(r"C:\Users\hp\PYTHON\weather_data_XL (3).xlsx")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad           28.0        60.0     Sunny
1 2025-01-02    Hyderbad           29.0        62.0     Sunny
2 2025-01-03    Hyderbad            NaN        58.0    Cloudy
3 2025-01-04    Hyderbad           31.0        55.0    Cloudy
4 2025-01-05    Banglore            NaN         NaN     Rainy
5 2025-01-06    Banglore           33.0        59.0     Rainy
6 2025-01-07    Banglore           34.0        61.0     Sunny
7 2025-01-08    Banglore           32.0        63.0    Cloudy
8 2025-01-09  Vijayawada            NaN        64.0     Rainy
9 2025-01-10  Vijayawada           29.0         NaN     Sunny

## Missing values

In [2]:
df.isnull()

    Date   City  Temperature_C  Humidity_%  Condition
0  False  False          False       False      False
1  False  False          False       False      False
2  False  False           True       False      False
3  False  False          False       False      False
4  False  False           True        True      False
5  False  False          False       False      False
6  False  False          False       False      False
7  False  False          False       False      False
8  False  False           True       False      False
9  False  False          False        True      False

In [3]:
df.isnull().sum()

Date             0
City             0
Temperature_C    3
Humidity_%       2
Condition        0
dtype: int64

In [4]:
df_clean=df.dropna()
df_clean

        Date      City  Temperature_C  Humidity_% Condition
0 2025-01-01  Hyderbad           28.0        60.0     Sunny
1 2025-01-02  Hyderbad           29.0        62.0     Sunny
3 2025-01-04  Hyderbad           31.0        55.0    Cloudy
5 2025-01-06  Banglore           33.0        59.0     Rainy
6 2025-01-07  Banglore           34.0        61.0     Sunny
7 2025-01-08  Banglore           32.0        63.0    Cloudy

In [5]:
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad           28.0        60.0     Sunny
1 2025-01-02    Hyderbad           29.0        62.0     Sunny
2 2025-01-03    Hyderbad            NaN        58.0    Cloudy
3 2025-01-04    Hyderbad           31.0        55.0    Cloudy
4 2025-01-05    Banglore            NaN         NaN     Rainy
5 2025-01-06    Banglore           33.0        59.0     Rainy
6 2025-01-07    Banglore           34.0        61.0     Sunny
7 2025-01-08    Banglore           32.0        63.0    Cloudy
8 2025-01-09  Vijayawada            NaN        64.0     Rainy
9 2025-01-10  Vijayawada           29.0         NaN     Sunny

In [6]:
df['Temperature_C']=df['Temperature_C'].fillna(0)

In [7]:
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad           28.0        60.0     Sunny
1 2025-01-02    Hyderbad           29.0        62.0     Sunny
2 2025-01-03    Hyderbad            0.0        58.0    Cloudy
3 2025-01-04    Hyderbad           31.0        55.0    Cloudy
4 2025-01-05    Banglore            0.0         NaN     Rainy
5 2025-01-06    Banglore           33.0        59.0     Rainy
6 2025-01-07    Banglore           34.0        61.0     Sunny
7 2025-01-08    Banglore           32.0        63.0    Cloudy
8 2025-01-09  Vijayawada            0.0        64.0     Rainy
9 2025-01-10  Vijayawada           29.0         NaN     Sunny

In [8]:
df["Humidity_%"]=df["Humidity_%"].fillna(df["Humidity_%"].mean())

In [9]:
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad           28.0       60.00     Sunny
1 2025-01-02    Hyderbad           29.0       62.00     Sunny
2 2025-01-03    Hyderbad            0.0       58.00    Cloudy
3 2025-01-04    Hyderbad           31.0       55.00    Cloudy
4 2025-01-05    Banglore            0.0       60.25     Rainy
5 2025-01-06    Banglore           33.0       59.00     Rainy
6 2025-01-07    Banglore           34.0       61.00     Sunny
7 2025-01-08    Banglore           32.0       63.00    Cloudy
8 2025-01-09  Vijayawada            0.0       64.00     Rainy
9 2025-01-10  Vijayawada           29.0       60.25     Sunny